gs-consuming-web-service/src/test/resources/ValidSoapRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header />
	<soap:Body>
		<getCountryRequest xmlns="http://spring.io/guides/gs-producing-web-service">
			<name>Spain</name>
		</getCountryRequest>
	</soap:Body>
</soap:Envelope>